HTML_and_CSS_Design_and_Build_Websites/000.Home.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-03 Sun 12:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>HTML &amp; CSS - Design and Build Websites</title>
<meta name="author" content="Alfredo Mejia" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../resources/bulma/bulma.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">HTML &amp; CSS - Design and Build Websites</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb59f8d8">Navigation</a></li>
<li><a href="#org9660fd9">Book Details</a></li>
<li><a href="#org8f5e2ad">Contents</a></li>
<li><a href="#org3f793c8">Resources</a></li>
<li><a href="#orgcdecc7a">My Thoughts</a>
<ul>
<li><a href="#orgeb93418">HTML Section</a></li>
<li><a href="#org419f578">CSS Section</a></li>
<li><a href="#orgb1ab7cc">Final Thoughts</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb59f8d8" class="outline-2">
<h2 id="orgb59f8d8">Navigation</h2>
<div class="outline-text-2" id="text-orgb59f8d8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Nav</th>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Links</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Index</td>
<td class="org-left">Notes Home</td>
<td class="org-left">&vert; <a href="../index.html">html</a> &vert; <a href="../index.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Home</td>
<td class="org-left">HTML &amp; CSS - Design and Build Websites</td>
<td class="org-left">&vert; <a href="./000.Home.html">html</a> &vert; <a href="./000.Home.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Prev</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Next</td>
<td class="org-left">Chapter 1: Structure</td>
<td class="org-left">&vert; <a href="./001.Structure/001.000.Notes.html">html</a> &vert; <a href="./001.Structure/001.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/001.Structure">github</a> &vert;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org9660fd9" class="outline-2">
<h2 id="org9660fd9">Book Details</h2>
<div class="outline-text-2" id="text-org9660fd9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Title</td>
<td class="org-left">HTML &amp; CSS - Design and Build Websites</td>
</tr>

<tr>
<td class="org-left">Edition</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Author</td>
<td class="org-left">Jon Duckett</td>
</tr>

<tr>
<td class="org-left">Publisher</td>
<td class="org-left">John Wiley &amp; Sons, Inc.</td>
</tr>

<tr>
<td class="org-left">Year</td>
<td class="org-left">2011</td>
</tr>

<tr>
<td class="org-left">ISBN</td>
<td class="org-left">978-1-118-00818-8</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org8f5e2ad" class="outline-2">
<h2 id="org8f5e2ad">Contents</h2>
<div class="outline-text-2" id="text-org8f5e2ad">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Chapter</th>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Links</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">Structure</td>
<td class="org-left">&vert; <a href="./001.Structure/001.000.Notes.html">html</a> &vert; <a href="./001.Structure/001.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/001.Structure">github</a> &vert;</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">Text</td>
<td class="org-left">&vert; <a href="./002.Text/002.000.Notes.html">html</a> &vert; <a href="./002.Text/002.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/002.Text">github</a> &vert;</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Lists</td>
<td class="org-left">&vert; <a href="./003.Lists/003.000.Notes.html">html</a> &vert; <a href="./003.Lists/003.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/003.Lists">github</a> &vert;</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">Links</td>
<td class="org-left">&vert; <a href="./004.Links/004.000.Notes.html">html</a> &vert; <a href="./004.Links/004.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/004.Links">github</a> &vert;</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">Images</td>
<td class="org-left">&vert; <a href="./005.Images/005.000.Notes.html">html</a> &vert; <a href="./005.Images/005.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/005.Images">github</a> &vert;</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">Tables</td>
<td class="org-left">&vert; <a href="./006.Tables/006.000.Notes.html">html</a> &vert; <a href="./006.Tables/006.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/006.Tables">github</a> &vert;</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">Forms</td>
<td class="org-left">&vert; <a href="./007.Forms/007.000.Notes.html">html</a> &vert; <a href="./007.Forms/007.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/007.Forms">github</a> &vert;</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">Extra Markup</td>
<td class="org-left">&vert; <a href="./008.Extra_Markup/008.000.Notes.html">html</a> &vert; <a href="./008.Extra_Markup/008.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/008.Extra_Markup">github</a> &vert;</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">Flash, Video, &amp; Audio</td>
<td class="org-left">&vert; <a href="./009.Flash_Video_and_Audio/009.000.Notes.html">html</a> &vert; <a href="./009.Flash_Video_and_Audio/009.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/009.Flash_Video_and_Audio">github</a> &vert;</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">Introducing CSS</td>
<td class="org-left">&vert; <a href="./010.Introducing_CSS/010.000.Notes.html">html</a> &vert; <a href="./010.Introducing_CSS/010.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/010.Introducing_CSS">github</a> &vert;</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-left">Color</td>
<td class="org-left">&vert; <a href="./011.Color/011.000.Notes.html">html</a> &vert; <a href="./011.Color/011.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/011.Color">github</a> &vert;</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-left">Text</td>
<td class="org-left">&vert; <a href="./012.Text/012.000.Notes.html">html</a> &vert; <a href="./012.Text/012.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/012.Text">github</a> &vert;</td>
</tr>

<tr>
<td class="org-right">13</td>
<td class="org-left">Boxes</td>
<td class="org-left">&vert; <a href="./013.Boxes/013.000.Notes.html">html</a> &vert; <a href="./013.Boxes/013.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/013.Boxes">github</a> &vert;</td>
</tr>

<tr>
<td class="org-right">14</td>
<td class="org-left">Lists, Tables &amp; Forms</td>
<td class="org-left">&vert; <a href="./014.Lists_Tables_and_Forms/014.000.Notes.html">html</a> &vert; <a href="./014.Lists_Tables_and_Forms/014.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/014.Lists_Tables_and_Forms">github</a> &vert;</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-left">Layout</td>
<td class="org-left">&vert; <a href="./015.Layout/015.000.Notes.html">html</a> &vert; <a href="./015.Layout/015.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/015.Layout">github</a> &vert;</td>
</tr>

<tr>
<td class="org-right">16</td>
<td class="org-left">Images</td>
<td class="org-left">&vert; <a href="./016.Images/016.000.Notes.html">html</a> &vert; <a href="./016.Images/016.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/016.Images">github</a> &vert;</td>
</tr>

<tr>
<td class="org-right">17</td>
<td class="org-left">HTML5 Layout</td>
<td class="org-left">&vert; <a href="./017.HTML5_Layout/017.000.Notes.html">html</a> &vert; <a href="./017.HTML5_Layout/017.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/017.HTML5_Layout">github</a> &vert;</td>
</tr>

<tr>
<td class="org-right">18</td>
<td class="org-left">Process &amp; Design</td>
<td class="org-left">&vert; <a href="./018.Process_and_Design/018.000.Notes.html">html</a> &vert; <a href="./018.Process_and_Design/018.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/018.Process_and_Design">github</a> &vert;</td>
</tr>

<tr>
<td class="org-right">19</td>
<td class="org-left">Practical Information</td>
<td class="org-left">&vert; <a href="./019.Practical_Information/019.000.Notes.html">html</a> &vert; <a href="./019.Practical_Information/019.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/019.Practical_Information">github</a> &vert;</td>
</tr>
</tbody>
</table>


<ol class="org-ol">
<li>Structure [<a href="001.Structure/001.000.Notes.html">html</a>] [<a href="001.Structure/001.000.Notes.html">org</a>] [<a href="https://github.com/alfredo-mejia/notes/tree/main/HTML%20%26%20CSS%20-%20Design%20and%20Build%20Websites/001.Structure">github</a>]</li>
<li>Text [<a href="002.Text/002.000.Notes.html">html</a>] [<a href="./002.Text/002.000.Notes.html">org</a>] [<a href="https://github.com/alfredo-mejia/notes/tree/main/HTML%20%26%20CSS%20-%20Design%20and%20Build%20Websites/002.Text">github</a>]</li>
<li>Lists [<a href="003.Lists/003.000.Notes.html">html</a>] [<a href="003.Lists/003.000.Notes.html">org</a>] [<a href="https://github.com/alfredo-mejia/notes/tree/main/HTML%20%26%20CSS%20-%20Design%20and%20Build%20Websites/003.Lists">github</a>]</li>
<li>Links [<a href="004.Links/004.000.Notes.html">html</a>] [<a href="004.Links/004.000.Notes.html">org</a>] [<a href="https://github.com/alfredo-mejia/notes/tree/main/HTML%20%26%20CSS%20-%20Design%20and%20Build%20Websites/004.Links">github</a>]</li>
<li>Images [<a href="./005.Images/005.000.Notes.html">html</a>] [<a href="./005.Images/005.000.Notes.html">org</a>] [<a href="https://github.com/alfredo-mejia/notes/tree/main/HTML%20%26%20CSS%20-%20Design%20and%20Build%20Websites/005.Images">github</a>]</li>
<li>Tables [<a href="./006.Tables/006.000.Notes.html">html</a>] [<a href="./006.Tables/006.000.Notes.html">org</a>] [<a href="https://github.com/alfredo-mejia/notes/tree/main/HTML%20%26%20CSS%20-%20Design%20and%20Build%20Websites/006.Tables">github</a>]</li>
<li>Forms [<a href="./007.Forms/007.000.Notes.html">html</a>] [<a href="./007.Forms/007.000.Notes.html">org</a>] [<a href="https://github.com/alfredo-mejia/notes/tree/main/HTML%20%26%20CSS%20-%20Design%20and%20Build%20Websites/007.Forms">github</a>]</li>
<li>Extra Markup [<a href="./008.Extra Markup/008.000.Notes.html">html</a>] [<a href="./008.Extra Markup/008.000.Notes.html">org</a>] [<a href="https://github.com/alfredo-mejia/notes/tree/main/HTML%20%26%20CSS%20-%20Design%20and%20Build%20Websites/008.Extra%20Markup">github</a>]</li>
<li>Flash, Video &amp; Audio [<a href="./009.Flash, Video &amp; Audio/009.000.Notes.html">html</a>] [<a href="./009.Flash, Video &amp; Audio/009.000.Notes.html">org</a>] [<a href="https://github.com/alfredo-mejia/notes/tree/main/HTML%20%26%20CSS%20-%20Design%20and%20Build%20Websites/009.Flash%2C%20Video%20%26%20Audio">github</a>]</li>
<li>Introducing CSS [<a href="./010.Introducing CSS/010.000.Notes.html">html</a>] [<a href="./010.Introducing CSS/010.000.Notes.html">org</a>] [<a href="https://github.com/alfredo-mejia/notes/tree/main/HTML%20%26%20CSS%20-%20Design%20and%20Build%20Websites/010.Introducing%20CSS">github</a>]</li>
<li>Color [<a href="./011.Color/011.000.Notes.html">html</a>] [<a href="./011.Color/011.000.Notes.html">org</a>] [<a href="https://github.com/alfredo-mejia/notes/tree/main/HTML%20%26%20CSS%20-%20Design%20and%20Build%20Websites/011.Color">github</a>]</li>
<li>Text [<a href="./012.Text/012.000.Notes.html">html</a>] [<a href="./012.Text/012.000.Notes.html">org</a>] [<a href="https://github.com/alfredo-mejia/notes/tree/main/HTML%20%26%20CSS%20-%20Design%20and%20Build%20Websites/012.Text">github</a>]</li>
<li>Boxes</li>
<li>Lists, Tables &amp; Forms</li>
<li>Layout</li>
<li>Images</li>
<li>HTML5 Layout</li>
<li>Process &amp; Design</li>
<li>Practical Information</li>
</ol>
</div>
</div>

<div id="outline-container-org3f793c8" class="outline-2">
<h2 id="org3f793c8">Resources</h2>
<div class="outline-text-2" id="text-org3f793c8">
<p>
<a href="https://wtf.tw/ref/duckett.pdf">Online PDF Book Link</a>
</p>
</div>
</div>


<div id="outline-container-orgcdecc7a" class="outline-2">
<h2 id="orgcdecc7a">My Thoughts</h2>
<div class="outline-text-2" id="text-orgcdecc7a">
</div>
<div id="outline-container-orgeb93418" class="outline-3">
<h3 id="orgeb93418">HTML Section</h3>
<div class="outline-text-3" id="text-orgeb93418">
<p>
I have completed the HTML section of the book. This includes Chapter 1 all the way to Chapter 9. The first question that I should ask myself, did I learn anything? The answer is ehh. Almost all of the chapters follow a similar pattern: introduce a HTML element, show an example, and go over the HTML element behavior and attributes. This is very similar to Mozilla web docs except that the web docs are up-to-date while this book, in the 2020s, is outdated. The book was not as engaging as I would have liked. There were no exercises or projects to test our understanding, and as someone who knew a little bit of HTML before reading the book, the book it was hard to finish.
</p>

<p>
Although the book is outdated I did enjoy reading about old technologies such as Adobe Flash and XHTML 1.0. I enjoy learning about computing history and this book helped me get exposed to the answers of why we needed new technologies, why Adobe Flash got discountined, why XHTML 1.0. didn't work, why we needed HTML5, why we needed JSON, and more. This information is more for my curiousity than my actual benefit. Nevertheless, I am going to continue with book and finish the CSS section. I know a little bit less of CSS than HTML so I hope this next section is a bit more beneficial for me.
</p>
</div>
</div>

<div id="outline-container-org419f578" class="outline-3">
<h3 id="org419f578">CSS Section</h3>
</div>

<div id="outline-container-orgb1ab7cc" class="outline-3">
<h3 id="orgb1ab7cc">Final Thoughts</h3>
</div>
</div>
</div>
</body>
</html>
